#файл конфигурации приложения store джанго для каждого приложения создаёт такой класс
#по сути это паспорт приложения  в сеттингс.пу в installed_apps есть store джанго находит это приложение и читает apps.py чтобы понять настройки
from django.apps import AppConfig# базовый класс конфигурации приложения джанго 


class StoreConfig(AppConfig):#класс настроек приложения
    default_auto_field = 'django.db.models.BigAutoField'#какой тип поля исп для автоматических первичных ключей id в моделях этого приложения BigAutoField - 64 битный автоинкремент (много записей влезет ), тоже сто в сеттингс но на уровне приложухи
    name = 'store'# имя приложения джпнго по нему находит приложение